Aoooa/ESP32_LVGL_Embedeed_Debug_Tool/Program/Embedded_debug_tool/sdkconfig.defaults
# ── 目标/板级（sdkconfig 重建时保持；缺失会导致生成"裸默认"配置） ──
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# ── PSRAM（8MB 八线；应用大量使用 PSRAM：示波器帧缓冲/任务栈/httpd） ──
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_CS_IO=26
CONFIG_SPIRAM_CLK_IO=30
CONFIG_DEFAULT_PSRAM_CS_IO=26
CONFIG_DEFAULT_PSRAM_CLK_IO=30
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_PRE_CONFIGURE_MEMORY_PROTECTION=y
CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=y
CONFIG_STDATOMIC_S32C1I_SPIRAM_WORKAROUND=y

# 性能关键配置（sdkconfig 重建时保持）
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_ENABLE_EXFAT=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

# LVGL 运行时（多渲染单元需 OS；池 512KB；绘制线程参数）——
# Kconfig 默认 LV_OS_NONE/LV_MEM_SIZE=64，重建 sdkconfig 若缺这几项会
# 编译报错或内存退化，必须在此显式保持
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_MEM_SIZE_KILOBYTES=512
CONFIG_LV_DRAW_THREAD_STACK_SIZE=8192
CONFIG_LV_DRAW_THREAD_PRIO=3
# 项目 UI 使用的小号 Montserrat 内置字体（10/12/14/16/28；14 为默认 y）
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y

CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/sdcard"
CONFIG_LV_FS_STDIO_CACHE_SIZE=512
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_FONT_MANAGER=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
# 关闭 LVGL 示例编译：运行期不使用示例代码，且 font_manager 示例依赖
# freetype（freetype 会要求 32KB 绘制线程栈，内部 RAM 吃紧）；关掉示例
# 可省 flash 且无需 freetype。重建 sdkconfig 缺此项会编译失败。
# CONFIG_LV_BUILD_EXAMPLES is not set

CONFIG_LV_USE_FLOAT=y
CONFIG_LV_USE_GESTURE_RECOGNITION=y

# 控制台：主 UART0（GPIO43/44，外接 USB-UART 调试）+ 副 USB-Serial/JTAG。
# 读卡器 TinyUSB 接管 USB PHY 时 COM14 静默，但 UART0(COM10) 日志不断
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# HTTP 服务器：WebSocket 转发（UART 数据网页实时推送）必需
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y

# USB 读卡器 APP（SD 卡 MSC，esp_tinyusb 组件）
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=2048
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_PRODUCT_STRING="SD Card Reader"

# USB DAP Link（CMSIS-DAP v1 HID，PC 免驱动；与 MSC 互斥使用 USB PHY）
CONFIG_TINYUSB_HID_COUNT=2

# USB-UART 桥接 APP（TinyUSB CDC-ACM；与 MSC/HID 互斥使用 USB PHY）
CONFIG_TINYUSB_CDC_ENABLED=y

# WiFi 内存收缩（内部 DMA RAM 紧张：显示双缓冲占大头，WiFi 静态缓冲需内部 RAM）
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=4
# CONFIG_ESP_WIFI_AMPDU_TX_ENABLED is not set
# CONFIG_ESP_WIFI_AMPDU_RX_ENABLED is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_SAE is not set
# CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA is not set

# lwip 内存裁剪（内部 RAM 紧张）。注意 LWIP_MAX_SOCKETS 下限：
# ESP httpd 内部保留 3 socket（校验 max_open_sockets+3 <= LWIP_MAX_SOCKETS，
# esp_http_server/src/httpd_main.c），故 12 = httpd(5+3) + tcp 监听(2) + 客户端余量(2)。
# TCP_SND/WND 2048 为每连接按需分配，运行期每连接省 ~7.4KB。
CONFIG_LWIP_MAX_SOCKETS=12
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2048
CONFIG_LWIP_TCP_WND_DEFAULT=2048
CONFIG_LWIP_UDP_RECVMBOX_SIZE=4

# mbedtls：业务无 TLS 会话，关闭 x509 cert bundle（省 67KB flash rodata，
# XIP 映射不占 RAM）+ 动态缓冲
# CONFIG_MBEDTLS_CERTIFICATE_BUNDLE is not set
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
